# Shell
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "powerlevel10k"

# Terminal & Multiplexer
cask "wezterm"
brew "tmux"

# Window Management
cask "aerospace"

# Editor
brew "neovim"

# Version Control
brew "git"
brew "gh"
brew "lazygit"

# Secrets & Auth
cask "1password"
brew "1password-cli"

# Containers
brew "podman"
brew "lazydocker"

# Kubernetes
brew "krew"

# System
brew "htop"
brew "eza"

# Notes
cask "obsidian"

# Fonts
cask "font-meslo-lg-nerd-font"
